["What actor/actress do you prefer?","What is the most disgusting thing you've ever done?","What was your funniest first date ever?","What is your weirdest habit?","What is one embarrassing fact I should know about you?","What was your childhood nickname?","What is your favourite movie?","If there was no such thing as money, what would you do with your life?","What is your favourite food?","What are your three favourite colours, and why?","What is your dream job?","If you were trapped on an island for 3 days, what would you take with you?","Who is your favourite person and why?","Do you prefer apple or android?","How do you put your toilet paper on the roll?","What is your best talent?","How do you feel about end pieces of a loaf of bread?","Can you touch your tongue to your nose?","If you could take away one bad thing in the world, what would it be?","What is your guilty pleasure?","What is the most exotic food that you have ever eaten?","What country would like to live in if you had the chance?","If you could change one thing on your body, what would it be?","What do you daydream about the most?","Describe the weirdest dream you’ve ever had?","Can you lick your elbow?","What is your favourite season of the year?","Could you go a week without junk food?","Do you like to exercise?","What is your favourite color?","What is your favourite animal?","What is your favourite food?","What is your favourite school subject?","Who is your favourite teacher, and why?","What is your favourite song?","Who is your favourite Disney character?","What is your favourite TV show?","What is your pet’s name?","What is your shoe size?","What is your favourite movie?","Who is your favourite singer?","Do you like bugs?","What is your favourite vegetable?","15. Would you rather be a chicken or duck?","16. Would you rather be a pig or snake?","What is your favourite game to play?","Do you like doing chores?","What is your favourite thing to do on the weekends?","Do you know how to dance?","Do you know how to cook?","Can you speak a different language?","What is your favourite thing to do after school?","Are you in any sports?","What is your favourite sport?","What animal are you scared of?","Are you scared of monsters?","Do you have an imaginary friend?","Who is your best friend?","When did you learn how to ride a bike?","Can you use a pogo stick?","What do you want to be when you grow up?","What is your favourite sport in the Olympics?","What is the capital of the state that you live in?","If you could go anywhere in the world, where would you go?","If you a million dollars, what would you do with all of your money?","If you could dye your hair any colour, what colour would you pick?","How many brothers and sisters do you have?","If you could be any animal, which one would you be?","What is your favourite place to go out to eat?","How people have you slept with on campus?","What is your real GPA?","What is your least favourite frat on campus?","What did you do on your first night of freshman year?","Have you ever blacked out from drinking too much?","What is the craziest thing that you have ever done while drunk?","Who is the best roommate that you have ever had?","What is the most annoying thing that your roommate has ever done?","Did you smoke or drink before college? Or did you start when you got here?","Would you drop out of school if you were to win the lottery?","What is the best party that you’ve ever been to?","How many parties have you thrown at your house?","What is most amount of shots that you have taken in one night?","Have you ever thrown up in someone’s car?","Have you ever wet bed from being too drunk?","What is the longest you have gone without sleep?","How many times have you skipped class for no reason?","Have you ever gotten an STD?","Have you ever woken up to a stranger in your bed?","What is the earliest you have ever started drinking in the day?","Have you ever spent your parent’s money on alcohol?","How many freshmen have you slept with?","Have you ever taken money from a freshman?","Have you ever lied to your parents about if you were in classes or not?","Have you ever taken money from your roommate?","What is the most annoying thing your roommate does?","Have you been in any fights while in school?","Have you ever had someone write a paper for you?","What is the most annoying thing that your mom does?","What is the most annoying thing that your dad does?","Have you ever snuck anyone into to the house?","How many times have you snuck out of the house?","What is the best dish that you mom makes for dinner?","If you could change any of the house rules, what would it be?","Would you rather be a horse or a cow?","What is the funniest thing your grandparents have ever said?","If you could get rid of one household chore, what would it be?","What is your favourite cartoon from your generation?","What is your favourite childhood song?","What is your favourite board game to play with your family?","If you could put one person in your family on mute for a day, who would it be?","At what age did you learn to ride a bike?","Do you know how to swim?","Describe your dream home","What is the funniest dream that you have ever had?","Have you ever had a dream about one of your relatives?","Who is your celebrity husband or wife?","Who taught you how to tie your shoes?","What is the longest that you have ever been without taking a shower?","Have you ever worn the same clothes for more than three days?","What is your favourite holiday and why?","If you could be any dinosaur, which would it be?","How long could you without eating your favourite food?","Who in your family tells the corniest jokes?","Would you rather be a bumblebee or a slug?","Have you ever eaten a worm?","Have you ever picked your nose when you thought no one was looking?","If you could be any super villain, who would you be?","Have you ever cheated on any test?","Who is the most annoying person you know?","Have you ever pulled a prank on your teacher?","Have you ever lied to your parents about what you were doingafter school?","Have you ever blamed something that you have done on one of your siblings?","What college do you plan on going to?","What is your biggest pet peeve?","What is the best vacation you’ve ever been on?","Have you ever told one of your best friend’s secrets, even if you said you wouldn’t?","What is the most annoying thing that one of your siblings has done?","Do you have a job? If so, what is your favourite thing aboutit?","If you were a billionaire, what would you spend your time doing?","What is the longest time you have ever been grounded?","What is the longest time that you think you could go withoutyour cell phone?","What is the most expensive thing you own?","If you had the choice to live on your own right now, would you do it?","Can you see yourself being married to the creepiest kid a your school someday?","If you could own your own business one day, what would it be?","What is your favourite kind of clothing?","What celebrity are you obsessed with?","What is the funniest youtube video you have ever seen?","Who is the worst teacher you have ever had, why?","What is your favourite sports team?","What he craziest thing that you have ever done without yourparents knowing?","What would you do if your parents left the house to you fora whole week?","What is your favourite song that is out right now?","Could you go two months without talking to your friends?","How long have you gone without showering?","What don't you want anyone in this group to ask you? (Be sure to keep it in mind for future rounds!)","Have you ever told a lie during a game of Truth or Dare? What was it and why?","Have you ever stolen anything?","What's your scariest nightmare?","What do you think is your biggest physical flaw?","What kind of pajamas do you wear to bed?","What's the dumbest thing you've ever done on a dare?","Have you ever peed in the swimming pool?","Where is the strangest place you've used the bathroom?","Are you scared of dying? Why?","What is your biggest fear?","What happened on the worst day of your life?","Have you ever climbed a tree?","Have you ever sang and danced in the grocery store?","If you could be a superhero, what would your power be?","What would you do if you were invisible for a day?","If your life were made into a movie who would play you?","What's your biggest pet peeve?","What is your special talent?","What's the best meal you've ever had?","What's you favorite Disney movie and why?","What would you do with a million dollars if you ever won the lottery?","How many best friends have you had during your lifetime?","If you were stuck on a deserted island which friend would you want with you?","Which person here knows something about you that you wouldn't want revealed?","What are the three qualities you feel are most important in a friend?","What would make you lie for your friend?"]